backend/app/controllers/api/redemptions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "redemptions".* FROM "redemptions" INNER JOIN "rewards" ON "rewards"."id" = "redemptions"."reward_id" WHERE "redemptions"."user_id" = ? ORDER BY "redemptions"."redeemed_at" DESC  [["user_id", 1]]
---
    def index
      user = User.find_by(id: params[:id])
      return render json: { errors: ["Not found"] }, status: :not_found unless user

      list = user.redemptions.joins(:reward).order(redeemed_at: :desc).map do |r|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "redemptions" ("user_id", "reward_id", "redeemed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["reward_id", 1], ["redeemed_at", "2026-02-21 02:29:39.977529"], ["created_at", "2026-02-21 02:29:39.985411"], ["updated_at", "2026-02-21 02:29:39.985411"]]
UPDATE "users" SET "points_balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points_balance", 400], ["updated_at", "2026-02-21 02:29:39.989650"], ["id", 1]]
---
    def create
      user = User.find_by(id: params[:id])
      return render json: { errors: ["Not found"] }, status: :not_found unless user

      reward_id = params.dig(:redemption, :reward_id)&.to_i
      return render json: { errors: ["Missing reward_id"] }, status: :bad_request unless reward_id&.positive?

      reward = Reward.find_by(id: reward_id)
      return render json: { errors: ["Not found"] }, status: :not_found unless reward

      if user.points_balance < reward.points_cost
        return render json: { errors: ["Insufficient points"] }, status: :unprocessable_entity
      end

      now = Time.current.utc
      redemption = user.redemptions.create!(
        reward: reward,
        redeemed_at: now
      )
      user.update!(points_balance: user.points_balance - reward.points_cost)