backend/app/controllers/api/rewards_controller.rb

    def index
      rewards = Reward.order(:points_cost).map do |r|
---
SELECT "rewards".* FROM "rewards" ORDER BY "rewards"."points_cost" ASC