backend/app/controllers/api/topup_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "points_balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points_balance", 500], ["updated_at", "2026-02-21 02:29:58.257015"], ["id", 1]]
---
    def create
      user_id = params[:user_id].to_s.to_i
      add = params[:points].to_s.to_i
      add = params[:points].to_i if params[:points].is_a?(Numeric) && params[:points]

      if user_id.zero? || !add.positive?
        return render json: { errors: ["Missing user_id or points"] }, status: :bad_request
      end

      user = User.find_by(id: user_id)
      return render json: { errors: ["User not found"] }, status: :not_found unless user

      user.update!(points_balance: user.points_balance + add)